<?php

return [
    'not_authorized' => 'Δεν είσαι εξουσιοδοτημένος να πραγματοποιήσεις αυτή την ενέργεια',
    'auth_error' => 'Υπήρξε ένα πρόβλημα κατά την σύνδεση.',
    'authentication_required' => 'Απαιτείται έλεγχος ταυτότητας για να συνεχίσετε.',
    'remember_me' => 'Να με θυμάσαι',
    'sign_in' => 'Σύνδεση',
    'forgot_password' => 'Ξέχασα τον κωδικό μου!',
    'request_reset_text' => 'Ξέχασες τον κωδικό σου? Δεν ήρθε το τέλος του κόσμου! Απλά βάλε το email σου παρακάτω.',
    'reset_password_text' => 'Επαναφορά κωδικού του λογαριασμού σου.',
    'reset_password' => 'Επαναφορά του κωδικού',
    'email_sent' => 'Σας έχει σταλεί ένα email με πληροφορίες για το πως να επαναφέρετε τον κωδικό του λογαριασμού σας.',
    'failed' => 'Ο κωδικός/το όνομα χρήστη, δεν ταιριάζουν με κάποιο λογαριασμό ή ο κωδικός 2FA δεν είναι σωστός.',
    'throttle' => 'Υπήρξαν πολλές προσπάθειες σύνδεσης. Παρακαλώ δοκιμάστε ξανά σε :seconds δευτερόλεπτα.',
    'password_requirements' => 'Ο κωδικός πρέπει να αποτελείται από τουλάχιστον ένα κεφαλαίο, ένα πεζό, ένα αριθμητικό χαρακτήρα και πρέπει να είναι τουλάχιστον 8 χαρακτήρες σε μήκος.',
    'request_reset' => 'Εύρεση Λογαριασμού',
    '2fa_required' => 'Έλεγχος ταυτότητας 2 παραγόντων',
    '2fa_failed' => 'Ο κωδικός 2FA που παρείχατε δεν είναι σωστός',
    'totp_failed' => 'Υπήρξε ένα σφάλμα κατά την ταυτοποίηση του κωδικου TOTP.',
    '2fa_must_be_enabled' => 'Ο διαχειριστής έχει απαιτήσει ο λογαριασμός σας να έχει ενεργοποιημένη την ταυτοποίηση 2 παραγόντων για να χρησιμοποιήσετε το Panel.',
];