<?php

return [
    'validation_error' => 'There was an error with one or more fields in the request.',
    'errors' => [
        'return' => 'Επιστροφή στην προηγούμενη σελίδα',
        'home' => 'Επιστροφή στην Αρχική Σελίδα',
        '403' => [
            'header' => 'Forbidden',
            'desc' => 'Δεν έχεις τα δικαιώματα για πρόσβαση σε αυτόν τον πόρο.',
        ],
        '404' => [
            'header' => 'Δεν βρέθηκε το αρχείο',
            'desc' => 'Δεν καταφέραμε να βρούμε τον συγκεκριμένο πόρο στο σύστημα.',
        ],
        'installing' => [
            'header' => 'Πραγματοποιείται εγκατάσταση',
            'desc' => 'Αυτός ο server ακόμη εγκαθίσταται. Μπορεί να χρειαστούν λίγα λεπτά ακόμη. Θα σας έρθει ένα email μόλις ολοκληρωθεί να εγκατάσταση.',
        ],
        'suspended' => [
            'header' => 'Server σε αναστολή',
            'desc' => 'Αυτός ο server έχει ανασταλεί και δεν είναι προσβάσιμος',
        ],
        'maintenance' => [
            'header' => 'Το node είναι υπό συντήρηση',
            'title' => 'Προσωρινά μη διαθέσιμο',
            'desc' => 'Αυτό το node είναι υπό συντήρηση και γι\'αυτό προσωρινά δεν είναι διαθέσιμο.',
        ],
    ],
    'index' => [
        'header' => 'Οι servers σου',
        'header_sub' => 'Οι servers στους οποίους έχεις πρόσβαση.',
        'list' => 'Server List',
    ],
    'api' => [
        'index' => [
            'list' => 'Τα Keys σου',
            'header' => 'API Λογαριασμού',
            'header_sub' => 'Διαχειριστείτε τα API Keys που σας επιτρέπουν να εκτελείτε ενέργειες ενάντια στο Panel.',
            'create_new' => 'Δημιουργία νέου API Key',
            'keypair_created' => 'Ένα νέο API Key δημιουργήθηκε με επιτυχία.',
        ],
        'new' => [
            'header' => 'Νέο API Key',
            'header_sub' => 'Δημιουργία νέο API Key με πρόσβαση στον λογαριασμό σου',
            'form_title' => 'Λεπτομέρειες',
            'descriptive_memo' => [
                'title' => 'Περιγραφή',
                'description' => 'Γράψε μια σύντομη περιγραφή για το API Key που θα δημιουργήσεις',
            ],
            'allowed_ips' => [
                'title' => 'Επιτρεπόμενες διευθύνσεις IP',
                'description' => 'Εάν θέλετε να επιτρέψετε την χρήση αυτού του API Key μόνο σε συγκεκριμένες διευθύνσεις IP, εισάγετε τες. Οι IP πρέπει να τοποθετηθούν μία ανα γραμμή. Επιτρέπεται η σημείωση CIDR. Αφήστε το κενό για να επιτρέψετε την πρόσβαση σε οποιαδήποτε IP.',
            ],
        ],
    ],
    'account' => [
        'details_updated' => 'Οι πληροφορίες του λογαριασμού σου ενημερώθηκαν με επιτυχία',
        'invalid_password' => 'Ο κωδικός που εισήγαγες για τον λογαριασμό είναι λανθασμένος ',
        'header' => 'Ο λογαριασμός σου',
        'header_sub' => 'Διαχειριστείτε τα στοιχεία του λογαριασμού σας',
        'update_pass' => 'Ανανέωση κωδικού πρόσβασης',
        'update_email' => 'Ανανέωση διεύθυνσης email',
        'current_password' => 'Τρέχων κωδικός πρόσβασης',
        'new_password' => 'Νέος κωδικός πρόσβασης',
        'new_password_again' => 'Επανέλαβε τον νέο κωδικό',
        'new_email' => 'Νέα διεύθυνση email',
        'first_name' => 'Όνομα',
        'last_name' => 'Επωνυμο',
        'update_identity' => 'Ανανέωση ταυτότητας λογαριασμού',
        'username_help' => 'Το όνομα χρήστη πρέπει να είναι μοναδικό και μπορεί να περιέχει μόνο τους παρακάτω χαρακτήρες: :requirements.',
        'language' => 'Γλώσσα',
    ],
    'security' => [
        'session_mgmt_disabled' => 'Η ικανότητα να βλέπεις τις συνεδρίες σου δεν είναι ενεργοποιημένη απο τον διαχειριστή.',
        'header' => 'Ασφάλεια Λογαριασμού',
        'header_sub' => 'Ελέγξτε τις ενεργές συνεδρίες και τον έλεγχο ταυτότητας 2 παραγόντων.',
        'sessions' => 'Ενεργές συνεδρίες',
        '2fa_header' => 'Έλεγχος Ταυτότητας 2 Παραγόντων',
        '2fa_token_help' => 'Γράψε τον κωδικό 2FA Token που δημιουργήθηκε απο την εφαρμογή σου (Google Authenticator, Authy, etc.).',
        'disable_2fa' => 'Απενεργοποίηση Ταυτότητας 2 Παραγόντων',
        '2fa_enabled' => 'Ο έλεγχος ταυτότητας 2 παραγόντων είναι ενεργοποιημένος και θα χρειαστεί για να συνδεθείτε στο Panel. Αν επιθυμείτε να τον ενεργοποιήσετε, συμπληρώστε την φόρμα παρακάτω. (Θα χρειαστείτε έναν κωδικό 2FA για να μπορέσετε να το ενεργοποιήσετε)',
        '2fa_disabled' => 'Ο έλεγχος ταυτότητας 2 παραγόντων απενεργοποιήθηκε. Θα ήταν καλό να τον ενεργοποιήσετε για extra προστασία στον λογαριασμό σας',
        'enable_2fa' => 'Ενεργοποίηση Ταυτότητας 2 Παραγόντων',
        '2fa_qr' => 'Διαμόρφωση 2FA στη συσκευή σας',
        '2fa_checkpoint_help' => 'Χρησιμοποιήστε μια εφαρμογή 2FA στο τηλέφωνό σας για να τραβήξετε μια φωτογραφία του κώδικα QR προς τα αριστερά ή εισαγάγετε με μη αυτόματο τρόπο τον κωδικό κάτω από αυτόν. Μόλις το κάνετε, δημιουργήστε ένα token και εισάγετέ το παρακάτω.',
        '2fa_disable_error' => 'Ο κωδικός 2FA δεν είναι σωστός. Ο έλεγχος ταυτότητας 2 παραγόντων δεν ενεργοποιήθηκε.',
    ],
];