<?php

return [
    'daemon_connection_failed' => 'Υπήρξε μια εξαίρεση κατά την προσπάθεια επικοινωνίας με το Daemon με αποτέλεσμα έναν HTTP/:code κωδικό απόκρισης. Αυτή η εξαίρεση καταγράφηκε.',
    'node' => [
        'servers_attached' => 'Ένα node δεν πρέπει να έχει συνδεδεμένους servers ώστε να μπορέσει να διαγραφεί.',
        'daemon_off_config_updated' => 'Η διαμόρφωση daemon <strong> έχει ενημερωθεί </strong>, ωστόσο παρουσιάστηκε σφάλμα κατά την προσπάθεια αυτόματης ενημέρωσης του αρχείου διαμόρφωσης στο Daemon. Θα χρειαστεί να ενημερώσετε με μη αυτόματο τρόπο το αρχείο διαμόρφωσης (core.json) για το daemon για να εφαρμόσετε αυτές τις αλλαγές.',
    ],
    'allocations' => [
        'server_using' => 'Ένας server έχει εκχωρηθεί αυτήν την κατανομή. Μια κατανομή μπορεί να διαγραφεί μόνο εάν δεν έχει εκχωρηθεί σε κανέναν server.',
        'too_many_ports' => 'Η προσθήκη περισσότερων απο 1000 port την στιγμή δεν είναι δυνατή.',
        'invalid_mapping' => 'Η αντιστοίχιση που προβλέπεται για το port :port δεν είναι έγκυρη και δεν ήταν δυνατή η επεξεργασία.',
        'cidr_out_of_range' => 'Η σημειογραφία CIDR επιτρέπει μόνο μάσκες μεταξύ / 25 και / 32.',
        'port_out_of_range' => 'Οι θύρες σε μια κατανομή πρέπει να είναι μεγαλύτερες από 1024 και μικρότερες ή ίσες με 65535.',
    ],
    'nest' => [
        'delete_has_servers' => 'A Nest with active servers attached to it cannot be deleted from the Panel.',
        'egg' => [
            'delete_has_servers' => 'Ένα Egg με ενεργούς διακομιστές συνδεδεμένους σε αυτό δεν μπορεί να διαγραφεί από το Panel.',
            'invalid_copy_id' => 'Το Egg που επιλέχθηκε για την αντιγραφή του σεναρίου εγκατάστασης είτε δεν υπάρχει ή αντιγράφει κάποιο σενάριο εγκατάστασης απο μόνο του.',
            'must_be_child' => 'Η οδηγία "Αντιγραφή ρυθμίσεων από" για αυτό το Egg πρέπει να είναι θυγατρική επιλογή για το επιλεγμένο Nest.',
            'has_children' => 'Αυτό το Egg είναι γονέας σε ένα ή περισσότερα άλλα Eggs. Διαγράψτε αυτά τα Eggs πριν διαγράψετε αυτό το Egg.',
        ],
        'variables' => [
            'env_not_unique' => 'Η μεταβλητή περιβάλλοντος :name πρέπει να είναι μοναδική σε αυτό το Egg.',
            'reserved_name' => 'Η μεταβλητή περιβάλλοντος :name είναι προστατευμένη και δεν μπορεί να αντιστοιχιστεί σε μια μεταβλητή.',
            'bad_validation_rule' => 'Ο κανόνας επικύρωσης ":rule" δεν είναι έγκυρος κανόνας για αυτήν την εφαρμογή.',
        ],
        'importer' => [
            'json_error' => 'Παρουσιάστηκε σφάλμα κατά την προσπάθεια ανάλυσης του αρχείου JSON: :error.',
            'file_error' => 'Το παρεχόμενο αρχείο JSON δεν ήταν έγκυρο.',
            'invalid_json_provided' => 'Το αρχειο JSON δεν είναι σε μορφή που μπορεί να αναγνωριστεί.',
        ],
    ],
    'packs' => [
        'delete_has_servers' => 'Δεν είναι δυνατή η διαγραφή ενός πακέτου που είναι συνδεδεμένο σε ενεργούς servers',
        'update_has_servers' => 'Cannot modify the associated option ID when servers are currently attached to a pack.',
        'invalid_upload' => 'Το παρεχόμενο αρχείο δεν φαίνεται να είναι έγκυρο',
        'invalid_mime' => 'Το παρεχόμενο αρχείο δεν πληροί τον απαιτούμενο τύπο :type',
        'unreadable' => 'Το παρεχόμενο αρχείο δεν μπορεί να ανοιχτεί απο τον server.',
        'zip_extraction' => 'Παρουσιάστηκε εξαίρεση κατά την προσπάθεια εξαγωγής του αρχείου.',
        'invalid_archive_exception' => 'Το παρεχόμενο αρχείο πακέτου φαίνεται να λείπει ένα απαιτούμενο αρχείο archive.tar.gz ή import.json στον βασικό τομέα.',
    ],
    'subusers' => [
        'editing_self' => 'Δεν επιτρέπεται η επεξεργασία του δικού σας λογαριασμού χρηστών.',
        'user_is_owner' => 'Δεν μπορείτε να προσθέσετε τον κάτοχο του διακομιστή ως δευτερεύοντα χρήστη για αυτόν τον server.',
        'subuser_exists' => 'Ένας χρήστης με αυτήν τη διεύθυνση ηλεκτρονικού ταχυδρομείου έχει ήδη εκχωρηθεί ως δευτερεύων χρήστης για αυτόν τον server.',
    ],
    'databases' => [
        'delete_has_databases' => 'Δεν είναι δυνατή η διαγραφή διακομιστή κεντρικού υπολογιστή βάσης δεδομένων που έχει ενεργές βάσεις δεδομένων συνδεδεμένες σε αυτόν.',
    ],
    'tasks' => [
        'chain_interval_too_long' => 'Ο μέγιστος χρόνος διαστήματος για μια αλυσοδεμένη εργασία είναι 15 λεπτά.',
    ],
    'locations' => [
        'has_nodes' => 'Δεν είναι δυνατή η διαγραφή μιας τοποθεσίας με ενεργά Daemon σε αυτήν.',
    ],
    'users' => [
        'node_revocation_failed' => 'Αποτυχία ανάκλησης κλειδιών στο <a href=":link">Node #:node</a>. :error',
    ],
    'deployment' => [
        'no_viable_nodes' => 'Δεν βρέθηκαν nodes που να πληρούν τις απαιτήσεις που καθορίζονται για αυτόματη ρύθμιση.',
        'no_viable_allocations' => 'Δεν βρέθηκαν κατανομές που να πληρούν τις απαιτήσεις για αυτόματη ρύθμιση.',
    ],
    'api' => [
        'resource_not_found' => 'Ο ζητούμενος πόρος δεν βρέθηκε στο σύστημα.',
    ],
];


