<?php

return [
    'index' => [
        'title' => 'Βλέπεις τον :name',
        'header' => 'Κονσόλα server',
        'header_sub' => 'Διαχείριση του server σε πραγματικό χρόνο',
    ],
    'schedule' => [
        'header' => 'Διαχειριστής Σχεδίων',
        'header_sub' => 'Διαχειριστείτε όλα τα σχέδια αυτού του server σε ένα μέρος.',
        'current' => 'Τρέχοντα σχέδια',
        'new' => [
            'header' => 'Δημιουργία νέου σχεδίου',
            'header_sub' => 'Δημιουργήστε ένα νέο σύνολο προγραμματισμένων εργασιών για αυτόν τον server.',
            'submit' => 'Δημιουργία σχεδίου',
        ],
        'manage' => [
            'header' => 'Διαχείριση Σχεδίου',
            'submit' => 'Ενημέρωση Schedule',
            'delete' => 'Διαγραφή Schedule',
        ],
        'task' => [
            'time' => 'Μετά',
            'action' => 'Εκτέλεση δράσης',
            'payload' => 'Με εντολή',
            'add_more' => 'Προσθήκη άλλης εργασίας',
        ],
        'actions' => [
            'command' => 'Send Command',
            'power' => 'Power Action',
        ],
        'toggle' => 'Εναλλαγή κατάστασης',
        'run_now' => 'Ενεργοποίηση σχεδίου',
        'schedule_created' => 'Δημιουργήθηκε με επιτυχία ένα νέο σχέδιο για τον server.',
        'schedule_updated' => 'Το σχέδιο ενημερώθηκε',
        'unnamed' => 'Σχέδιο χωρίς ονομασία',
        'setup' => 'Ρύθμιση σχεδίου',
        'day_of_week' => 'Μέρα της εβδομάδος',
        'day_of_month' => 'Μέρα του μήνα',
        'hour' => 'Ώρα την μέρας',
        'minute' => 'Λεπτό της ώρας',
        'time_help' => 'Το σύστημα προγραμματισμού υποστηρίζει τη χρήση της σύνταξης Cronjob κατά τον καθορισμό του πότε πρέπει να αρχίσουν να εκτελούνται εργασίες. Χρησιμοποιήστε τα παραπάνω πεδία για να καθορίσετε πότε θα αρχίσουν να εκτελούνται αυτές οι εργασίες ή να επιλέξετε επιλογές από τα μενού πολλαπλών επιλογών.',
        'task_help' => 'Οι ώρες για τις εργασίες σχετίζονται με την εργασία που ορίστηκε προηγουμένως. Κάθε σχέδιο μπορεί να έχει μέχρι και 5 εργασίες που του έχουν ανατεθεί και οι εργασίες δεν μπορούν να προγραμματιστούν σε απόσταση μεγαλύτερη των 15 λεπτών η μια απο την αλλη.',
    ],
    'tasks' => [
        'task_created' => 'Δημιουργήθηκε με επιτυχία μια νέα εργασία στο Panel.',
        'task_updated' => 'Η εργασία ενημερώθηκε με επιτυχία. Τυχόν ενέργειες εργασίας που βρίσκονται σε ουρά θα ακυρωθούν και θα εκτελεστούν ξανά την επόμενη καθορισμένη ώρα.',
        'header' => 'Προγραμματισμένες εργασίες',
        'header_sub' => 'Αυτοματοποιήστε τον server σας.',
        'current' => 'Τρέχουσες προγραμματισμένες εργασίες',
        'actions' => [
            'command' => 'Αποστολή Εντολής',
            'power' => 'Αποστολή επιλογής λειτουργίας',
        ],
        'new_task' => 'Προσθήκη νέας εργασίας',
        'toggle' => 'Εναλλαγή κατάστασης',
        'new' => [
            'header' => 'Νέα εργασία',
            'header_sub' => 'Δημιουργήστε μια νέα προγραμματισμένη εργασία για αυτόν τον server.',
            'task_name' => 'Ονομα εργασίας',
            'day_of_week' => 'Μέρα της εβδομάδος',
            'custom' => 'Προσαρμοσμένη τιμή',
            'day_of_month' => 'Ημέρα του μήνα',
            'hour' => 'Ώρα',
            'minute' => 'Λεπτά',
            'sun' => 'Κυριακή',
            'mon' => 'Δευτέρα',
            'tues' => 'Τρίτη',
            'wed' => 'Τετάρτη',
            'thurs' => 'Πέμπτη',
            'fri' => 'Παρασκευή',
            'sat' => 'Σάββατο',
            'submit' => 'Δημιουργία εργασίας',
            'type' => 'Τύπος εργασίας',
            'chain_then' => 'Τότε, Μετά',
            'chain_do' => 'Εκτέλεσε',
            'chain_arguments' => 'Με τα Arguments',
            'payload' => 'Με εντολές',
            'payload_help' => 'Για παράδειγμα, αν επιλέξατε <code> Send Command </code> εισαγάγετε την εντολή εδώ. Εάν επιλέξατε <code> Send Power Option </code> θέστε την ενέργεια εδώ (π.χ. <code> επανεκκίνηση </code>).',
        ],
        'edit' => [
            'header' => 'Διαχείριση εργασίας',
            'submit' => 'Ενημέρωση εργασίας',
        ],
    ],
    'users' => [
        'header' => 'Διαχείριση χρηστών',
        'header_sub' => 'Ελέγξτε ποιος μπορεί να έχει πρόσβαση στον server σας.',
        'configure' => 'Διαμόρφωση Δικαιωμάτων',
        'list' => 'Λογαριασμοί με πρόσβαση',
        'add' => 'Προσθήκη νέου χρήστη',
        'update' => 'Ενημέρωση χρήστη',
        'user_assigned' => 'Καταχωρήθηκε με επιτυχία ένας νέος χρήστης σε αυτόν τον server.',
        'user_updated' => 'Τα δικαιώματα του χρήστη ενημερώθηκαν με επιτυχία.',
        'edit' => [
            'header' => 'Επεξεργασία Χρήστη',
            'header_sub' => 'Τροποποιήστε την πρόσβαση του χρήστη στον server.',
        ],
        'new' => [
            'header' => 'Προσθήκη νέου Χρήστη',
            'header_sub' => 'Προσθήκη ενός χρήστη με δικαιώματα, στον server',
            'email' => 'Διεύθυνση email',
            'email_help' => 'Εισαγάγετε τη διεύθυνση email του χρήστη που θέλετε να προσκαλέσετε για τη διαχείριση αυτού του server.',
            'power_header' => 'Διαχείριση power',
            'file_header' => 'Διαχείριση αρχείων',
            'subuser_header' => 'Διαχείριση χρηστών',
            'server_header' => 'Διαχείριση server',
            'task_header' => 'Διαχείριση σχεδίων',
            'database_header' => 'Διαχείριση των database',
            'power_start' => [
                'title' => 'Εκκίνηση',
                'description' => 'Επιτρέπει στον χρήστη να ξεκινήσει τον server.',
            ],
            'power_stop' => [
                'title' => 'Διακοπή',
                'description' => 'Επιτρέπει στον χρήστη να διακόψει τον server.',
            ],
            'power_restart' => [
                'title' => 'Επανεκκίνηση',
                'description' => 'Επιτρέπει στον χρήστη την επανεκκίνηση του server.',
            ],
            'power_kill' => [
                'title' => 'Αναγκαστική Διακοπή',
                'description' => 'Επιτρέπει στον χρήστη να διακόψει άμεσα την λειτουργία του server.',
            ],
            'send_command' => [
                'title' => 'Αποστολή εντολής στο console',
                'description' => 'Επιτρέπει στον χρήστη να στείλει εντολές στην κονσόλα. Εάν ο χρήστης δεν έχει το δικαίωμα να σταματήσει ή να επανεκκινήσει τον server, δεν μπορεί να στείλει την εντολή stop του server.',
            ],
            'access_sftp' => [
                'title' => 'Πρόσβαση SFTP',
                'description' => 'Επιτρέπει στον χρήστη να συνδεθεί στο SFTP του Daemon.',
            ],
            'list_files' => [
                'title' => 'Προβολή αρχείων',
                'description' => 'Επιτρέπει στον χρήστη να δει αρχεία και φακέλους αλλά δεν μπορεί να τα ανοίξει.',
            ],
            'edit_files' => [
                'title' => 'Επεξεργασία αρχείων',
                'description' => 'Επιτρέπει στον χρήστη να πραγματοποιήσει αλλαγές στα αρχεία του server. Το SFTP δεν επηρεάζεται με αυτό το δικαίωμα.',
            ],
            'save_files' => [
                'title' => 'Αποθήκευση αρχείων',
                'description' => 'Επιτρέπει στον χρήστη να αποθηκεύσει το περιεχόμενο των τροποποιημένων αρχείων. Το SFTP δεν επηρεάζεται με αυτό το δικαίωμα.',
            ],
            'move_files' => [
                'title' => 'Μετονομασία & Μετακίνηση αρχείων',
                'description' => 'Επιτρέπει στον χρήστη να μετονομάσει.',
            ],
            'copy_files' => [
                'title' => 'Αντιγραφή αρχείων',
                'description' => 'Επιτρέπει στον χρήστη να αντιγράψει αρχεία στο σύστημα.',
            ],
            'compress_files' => [
                'title' => 'Συμπίεση αρχείων',
                'description' => 'Επιτρέπει στον χρήστη να συμπιέσει φακέλους και αρχεία.',
            ],
            'decompress_files' => [
                'title' => 'Αποσυμπίεση',
                'description' => 'Επιτρέπει στον χρήστη να αποσυμπιέσει αρχεία .zip και .tar.gz.',
            ],
            'create_files' => [
                'title' => 'Δημιουργία Αρχείων',
                'description' => 'Επιτρέπει στον χρήστη να δημιουργήσει αρχεία στο Panel.',
            ],
            'upload_files' => [
                'title' => 'Ανέβασμα Αρχείων',
                'description' => 'Επιτρέπει στον χρήστη να ανεβάσει αρχεία μέσω του file manager',
            ],
            'delete_files' => [
                'title' => 'Διαγραφή Αρχείων',
                'description' => 'Επιτρέπει στον χρήστη να διαγράψει αρχεία απο το σύστημα.',
            ],
            'download_files' => [
                'title' => 'Κατέβασμα αρχείων',
                'description' => 'Επιτρέπει στον χρήστη να κατεβάσει αρχεία απο το Panel. Ο χρήστης μπορεί να κατεβάσει και να δει το περιεχόμενο των αρχείων του server, ακόμη και αν δεν του έχει δοθεί το δικαίωμα "Επεξεργασία Αρχείων".',
            ],
            'list_subusers' => [
                'title' => 'Προβολή χρηστών',
                'description' => 'Επιτρέπει στον χρήστη να δει τους χρήστες που έχουν πρόσβαση στον server.',
            ],
            'view_subuser' => [
                'title' => 'Προβολή δικαιωμάτων των χρηστών',
                'description' => 'Επιτρέπει στον χρήστη να δει τα δικαιώματα των άλλων χρηστών.',
            ],
            'edit_subuser' => [
                'title' => 'Επεξεργασία Χρηστών',
                'description' => 'Επιτρέπει στον χρήστη να επεξεργαστεί τα δικαιώματα που έχουν δωθεί σε κάποιο χρήστη.',
            ],
            'create_subuser' => [
                'title' => 'Δημιουργία χρήστη',
                'description' => 'Επιτρέπει στον χρήστη να προσθέσει άλλους χρήστες στον server.',
            ],
            'delete_subuser' => [
                'title' => 'Διαγραφή Χρήστη',
                'description' => 'Επιτρέπει στον χρήστη να αφαιρέσει χρήστες με πρόσβαση σε αυτον τον server.',
            ],
            'view_allocations' => [
                'title' => 'Προβολή κατανομών',
                'description' => 'Επιτρέπει στον χρήστη να δεί τις κατανομές του server.',
            ],
            'edit_allocation' => [
                'title' => 'Επεξεργασία προεπιλεγμένης κατανομής',
                'description' => 'Επιτρέπει στον χρήστη να αλλάξει την προεπιλεγμένη κατανομή του server.',
            ],
            'view_startup' => [
                'title' => 'Προβολή εντολής εκκίνησης',
                'description' => 'Επιτρέπει στον χρήστη να δεί την εντολή εκκίνησης και τις μεταβλητές της.',
            ],
            'edit_startup' => [
                'title' => 'Επεξεργασία εντολής εκκίνησης',
                'description' => 'Επιτρέπει στον χρήστη να επεξεργαστεί την εντολή εκκίνησης και να αλλάξει τις τιμές απο τις μεταβλητές της.',
            ],
            'list_schedules' => [
                'title' => 'Προβολή σχεδίων',
                'description' => 'Επιτρέπει στον χρήστη να δεί όλα τα σχέδια του server (ενεργοποιημένα ή απενεργοποιημένα).',
            ],
            'view_schedule' => [
                'title' => 'Προβολή σχεδίου',
                'description' => 'Επιτρέπει στον χρήστη να δεί ενός σχεδίου τις λεπτομέρειες και τις εργασίες.',
            ],
            'toggle_schedule' => [
                'title' => 'Αλλαγή σχεδίου',
                'description' => 'Επιτρέπει στον χρήστη να ενεργοποιήσει ή να απενεργοποιήσει ένα σχέδιο.',
            ],
            'queue_schedule' => [
                'title' => 'Τρέξιμο σχεδίου',
                'description' => 'Επιτρέπει στον χρήστη να τρέξει ένα σχέδιο.',
            ],
            'edit_schedule' => [
                'title' => 'Επεξεργασία σχεδίου',
                'description' => 'Επιτρέπει στον χρήστη να επεξεργαστεί ένα σχέδιο, να σβήσει η να διαγράψει τις εργασίες του αλλά δεν μπορεί να διαγράψει το σχέδιο απο το Panel.',
            ],
            'create_schedule' => [
                'title' => 'Δημιουργία σχεδίου',
                'description' => 'Επιτρέπει στον χρήστη να επεξεργαστεί ένα σχέδιο.',
            ],
            'delete_schedule' => [
                'title' => 'Διαγραφή σχεδίου',
                'description' => 'Επιτρέπει στον χρήστη να διαγράψει κάποιο σχέδιο απο τον server.',
            ],
            'view_databases' => [
                'title' => 'Προβολή στοιχείων Database',
                'description' => 'Επιτρέπει στον χρήστη να δει όλες τις πληροφορίες για τις βάσεις δεδομένων του server. Ο χρήστης έχει πρόσβαση σε ονόματα χρήστη και κωδικούς από τις βάσεις δεδομένων.',
            ],
            'reset_db_password' => [
                'title' => 'Επαναφορά κωδικού Database',
                'description' => 'Επιτρέπει στον χρήστη να επαναφέρει τον κωδικό για κάποια βάση δεδομένων.',
            ],
            'delete_database' => [
                'title' => 'Διαγραφή Database',
                'description' => 'Επιτρέπει στον χρήστη να αφαιρέσει μία βάση δεδομένων απο τον server.',
            ],
            'create_database' => [
                'title' => 'Δημιουργία Database',
                'description' => 'Επιτρέπει στον χρήστη να δημιουργήσει μια βαση δεδομενων στο Panel.',
            ],
        ],
    ],
    'allocations' => [
        'mass_actions' => 'Μαζικές πράξεις',
        'delete' => 'Διαγραφή διανομών',
    ],
    'files' => [
        'exceptions' => [
            'invalid_mime' => 'Αυτός ο τύπος αρχείου δεν υποστηρίζεται απο τον επεξεργαστή αρχείων του Panel.',
            'max_size' => 'Το αρχείο είναι πολύ μεγάλο για την επεξεργασία του μέσω του επεξεργαστή αρχείων του.',
        ],
        'header' => 'Διαχειριστής Αρχείων',
        'header_sub' => 'Διαχείριση αρχείων μέσω του Panel',
        'loading' => 'Φόρτωση αρχικής δομής αρχείων, αυτό μπορεί να διαρκέσει μερικά δευτερόλεπτα.',
        'path' => 'Κατά τη διαμόρφωση οποιωνδήποτε διαδρομών αρχείων στα πρόσθετα ή τις ρυθμίσεις του διακομιστή σας, θα πρέπει να χρησιμοποιήσετε το :path ως τη βασική σας διαδρομή. Το μέγιστο μέγεθος για μεταφορτώσεις αρχείων μέσω ιστού σε αυτόν το Νοδε είναι :size.',
        'seconds_ago' => 'δευτερόλεπτα πριν',
        'file_name' => 'Όνομα Αρχείου',
        'size' => 'Μέγεθος',
        'last_modified' => 'Τελευταία τροποποίηση',
        'add_new' => 'Δημιουργία νέου αρχείου',
        'add_folder' => 'Προσθήκη νέου φακέλου',
        'mass_actions' => 'Μαζικές πράξεις',
        'delete' => 'Διαγραφή αρχείων',
        'edit' => [
            'header' => 'Επεξεργασία αρχείου',
            'header_sub' => 'Κάνε τροποποιήσεις σε κάποιο αρχείο μέσω του Panel.',
            'save' => 'Αποθήκευση Αρχείου',
            'return' => 'Επιστροφή στον διαχειριστή αρχείων',
        ],
        'add' => [
            'header' => 'Νέο Αρχείο',
            'header_sub' => 'Δημιούργησε ένα καινούργιο αρχείο στον server.',
            'name' => 'Ονομασία Αρχείου',
            'create' => 'Δημιουργία Αρχείου',
        ],
    ],
    'config' => [
        'name' => [
            'header' => 'Όνομα server',
            'header_sub' => 'Άλλαξε το όνομα του server.',
            'details' => 'Το όνομα του server εμφανίζεται μόνο στο panel και ΔΕΝ θα επηρεάσει πως το όνομα του server που βλέπουν οι παίκτες.',
        ],
        'startup' => [
            'header' => 'Ρυθμίσεις εκκίνησης',
            'header_sub' => 'Έλεγχος παραμέτρων εκκίνησης.',
            'command' => 'Εντολή εκκίνησης',
            'edit_params' => 'Επεξεργασία παραμέτρων',
            'update' => 'Ενημέρωση παραμέτρων εκκίνησης',
            'startup_regex' => 'Κανόνες εισαγωγής',
            'edited' => 'Οι μεταβλητές εκκίνησης ενημερώθηκαν με επιτυχία. Θα εφαρμοστούν στην επόμενη εκκίνηση του server',
        ],
        'sftp' => [
            'header' => 'Ρυθμίσεις SFTP',
            'header_sub' => 'Λεπτομέρειες λογαριασμού για την σύνδεση SFTP',
            'details' => 'Λεπτομέρειες SFTP',
            'conn_addr' => 'Διεύθυνση σύνδεσης',
            'warning' => 'Ο κωδικός για τον SFTP Server είναι ο ίδιος με του λογαριασμού σας. Βεβαιωθήτε οτι το πρόγραμμα που χρησιμοποιείτε είναι για συνδέσεις SFTP και όχι FTP ή FTPS, καθώς υπάρχει διαφορά μεταξύ των προτόκολων.',
        ],
        'database' => [
            'header' => 'Βάσεις Δεδομένων',
            'header_sub' => 'Όλες οι βάσεις δεδομένων διαθέσιμες σε αυτόν τον server.',
            'your_dbs' => 'Διαμορφωμένες βάσεις δεδομένων',
            'host' => 'MySQL Host',
            'reset_password' => 'Επαναφορά κωδικού',
            'no_dbs' => 'Δεν υπάρχουν βάσεις δεδομένων σε αυτόν τον server.',
            'add_db' => 'Προσθήκη βάσης δεδομένων.',
        ],
        'allocation' => [
            'header' => 'Κατανομές διακομιστή',
            'header_sub' => 'Διαχείριση των διευθύνσεων IPs που είναι διαθέσιμες στον server.',
            'available' => 'Διαθέσιμες κατανομές',
            'help' => 'Βοήθεια',
            'help_text' => 'Η λίστα δίπλα δείχνει όλες τις διαθέσιμες IP & όλες τις διαθέσιμες θύρες του server που χρησιμοποιούνται για τις εισερχόμενες συνδέσεις του server.',
        ],
    ],
];


